rpc/test_data/set_parameter_attributes_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">123</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:SetParameterAttributes>
            <ParameterList soapenc:arrayType="cwmp:SetParameterAttributesStruct[1]">
                <SetParameterAttributesStruct>
                    <Name>Device.DeviceSummary</Name>
                    <NotificationChange>true</NotificationChange>
                    <Notification>1</Notification>
                    <AccessListChange>1</AccessListChange>
                    <AccessList soapenc:arrayType="xsd:string[1]">
                        <string>Subscriber</string>
                    </AccessList>
                </SetParameterAttributesStruct>
            </ParameterList>
        </cwmp:SetParameterAttributes>
    </soapenv:Body>
</soapenv:Envelope>
